import { MajorCategory } from 'Service';

export const majorData: Array<MajorCategory> = [
  {
    category: '인문',
    majors: [
      '기독교학과',
      '국어국문학과',
      '영어영문학과',
      '독어독문학과',
      '불어불문학과',
      '중어중문학과',
      '일어일문학과',
      '철학과',
      '사학과',
    ],
  },
  { category: '경상', majors: ['경영학부', '벤처중소기업학과', '회계학과', '경제학과', '글로벌통상학과', '금융학부'] },
  { category: '자연', majors: ['수학과', '물리학과', '화학과', '정보통계보험수리학과'] },
  { category: '법대', majors: ['법학과', '국제법무학과'] },
  {
    category: '사회',
    majors: ['사회복지학부', '행정학부', '정치외교학과', '정보사회학과', '언론홍보학과', '평생교육학과'],
  },
  {
    category: '공대',
    majors: [
      '기계공학부',
      '화학공학과',
      '전기공학부',
      '산업정보시스템공학과',
      '유기신소재파이버공학과',
      '의생명시스템학부',
      '건축학부',
    ],
  },
  { category: 'IT', majors: ['컴퓨터학부', '소프트웨어학부', '전자정보공학부', 'AI융합학부', '글로벌미디어학부'] },
  { category: '예체능', majors: ['문예창작', '영화예술', '스포츠학부'] },
  { category: '자유전공', majors: ['융합특성화자유전공학부'] },
];
